#ifndef __SOFT_I2C_H
#define __SOFT_I2C_H

/* 包含 --------------------------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
/* 私有宏 ------------------------------------------------------------------------------------*/
#define I2C_WR 0 /* 写控制bit */
#define I2C_RD 1 /* 读控制bit */
/* 私有结构体 --------------------------------------------------------------------------------*/

/* 函数声明 ----------------------------------------------------------------------------------*/
void i2c_Start(void);
void i2c_Stop(void);
void i2c_SendByte(uint8_t _ucByte);
uint8_t i2c_ReadByte(uint8_t Ack);
uint8_t i2c_WaitAck(void);
void i2c_Ack(void);
void i2c_NAck(void);
uint8_t i2c_CheckDevice(uint8_t _Address);

#endif

/* 文件结束 ----------------------------------------------------------------------------------*/
